/*!
 * @author Jan Nejedly support@3b-fly.eu
 * @copyright Jan Nejedly
 * @version 2.0.0
 * @license see license in 'LICENSE' file
*/



bbbfly.locale.Register({
  Lang: 'cs',
  Region: '-',

  CharOrder: '0123456789'
    +'aAáÁ'
    +'bB'
    +'cCčČ'
    +'dDďĎ'
    +'eEéÉěĚ'
    +'fF'
    +'gG'
    +'hH'
    +'iIíÍ'
    +'jJ'
    +'kK'
    +'lL'
    +'mM'
    +'nNňŇ'
    +'oOóÓ'
    +'pP'
    +'qQ'
    +'rRřŘ'
    +'sSšŠ'
    +'tTťŤ'
    +'uUúÚůŮ'
    +'vV'
    +'wW'
    +'xX'
    +'yYýÝ'
    +'zZžŽ',

  Diacritics: {
    'à': 'a', 'À': 'A',
    'á': 'a', 'Á': 'A',
    'â': 'a', 'Â': 'A',
    'ã': 'a', 'Ã': 'A',
    'ä': 'a', 'Ä': 'A',
    'å': 'a', 'Å': 'A',
    'ă': 'a', 'Ă': 'A',
    'ą': 'a', 'Ą': 'A',
    'æ': 'a', 'Æ': 'A',
    'þ': 'b', 'Þ': 'B',
    'č': 'c', 'Č': 'C',
    'ć': 'c', 'Ć': 'C',
    'ĉ': 'c', 'Ĉ': 'C',
    'ċ': 'c', 'Ċ': 'C',
    'ç': 'c', 'Ç': 'C',
    'ď': 'd', 'Ď': 'D',
    'đ': 'd', 'Đ': 'D',
    'ð': 'dj','Ð': 'Dj',
    'é': 'e', 'É': 'E',
    'ě': 'e', 'Ě': 'E',
    'è': 'e', 'È': 'E',
    'ê': 'e', 'Ê': 'E',
    'ë': 'e', 'Ë': 'E',
    'ę': 'e', 'Ę': 'E',
    'ƒ': 'f', 'Ƒ': 'F',
    'ĝ': 'g', 'Ĝ': 'G',
    'ğ': 'g', 'Ğ': 'G',
    'ġ': 'g', 'Ġ': 'G',
    'ģ': 'g', 'Ģ': 'G',
    'ĥ': 'h', 'Ĥ': 'H',
    'ħ': 'h', 'Ħ': 'H',
    'í': 'i', 'Í': 'I',
    'ì': 'i', 'Ì': 'I',
    'î': 'i', 'Î': 'I',
    'ï': 'i', 'Ï': 'I',
    'ĺ': 'l', 'Ĺ': 'L',
    'ļ': 'l', 'Ļ': 'L',
    'ľ': 'l', 'Ľ': 'L',
    'ŀ': 'l', 'Ŀ': 'L',
    'ł': 'l', 'Ł': 'L',
    'ň': 'n', 'Ň': 'N',
    'ñ': 'n', 'Ñ': 'N',
    'ń': 'n', 'Ń': 'N',
    'ņ': 'n', 'Ņ': 'N',
    'ó': 'o', 'Ó': 'O',
    'ò': 'o', 'Ò': 'O',
    'ô': 'o', 'Ô': 'O',
    'õ': 'o', 'Õ': 'O',
    'ő': 'o', 'Ő': 'O',
    'ö': 'o', 'Ö': 'O',
    'ø': 'o', 'Ø': 'O',
    'œ': 'oi', 'Œ': 'Oi',
    'ř': 'r', 'Ř': 'R',
    'ŕ': 'r', 'Ŕ': 'R',
    'ŗ': 'r', 'Ŗ': 'R',
    'š': 's', 'Š': 'S',
    'ś': 's', 'Ś': 'S',
    'ṡ': 's', 'Ṡ': 'S',
    'ŝ': 's', 'Ŝ': 'S',
    'ş': 's', 'Ş': 'S',
    'ṥ': 's', 'Ṥ': 'S',
    'ṧ': 's', 'Ṧ': 'S',
    'ṣ': 's', 'Ṣ': 'S',
    'ș': 's', 'Ș': 'S',
    'ṩ': 's', 'Ṩ': 'S',
    'ß': 'ss','ẞ': 'Ss',
    'ť': 't', 'Ť': 'T',
    'ţ': 't', 'Ţ': 'T',
    'ŧ': 't', 'Ŧ': 'T',
    'ú': 'u', 'Ú': 'U',
    'ů': 'u', 'Ů': 'U',
    'ù': 'u', 'Ù': 'U',
    'û': 'u', 'Û': 'U',
    'ű': 'u', 'Ű': 'U',
    'ü': 'u', 'Ü': 'U',
    'ý': 'y', 'Ý': 'Y',
    'ÿ': 'y', 'Ÿ': 'Y',
    'ž': 'z', 'Ž': 'Z',
    'ź': 'z', 'Ź': 'Z',
    'ż': 'z', 'Ż': 'Z'
  }
});